[{"title":"Dream company to kickstart your career with","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Amazing People willing to help out at any momentNo politicsGood compensationAwe inspiring perksFree breakfast and lunchBeautiful HQ CampusManagement listens to you and cares about you","cons":"Being brutally honest, there is nothing wrong with the company as of now","date":" 9 Sep 2017","company":"Vidyard","prosClean":"amazing people willing  help    momentno politicsgood compensationawe inspiring perksfree breakfast  lunchbeautiful hq campusmanagement listens    cares  ","consClean":"being brutally honest   nothing wrong   company   now","dateFull":"2017-09-09"},{"title":"Absolutely amazing company!","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":" Great selection of catered food Amazing atmosphere, the office is decked out like an IKEA Great and hilarious people Really approachable senior management Just a fantastic place to work in general, highly recommend it","cons":" Some of the processes haven't been figured out or streamlined yet, so things can definitely be more efficient. However, really minor issues","date":" 5 Feb 2017","company":"Vidyard","prosClean":" great selection  catered food amazing atmosphere  office  decked  like  ikea great  hilarious people really approachable senior management just  fantastic place  work  general highly recommend ","consClean":" some   processes   figured   streamlined yet  things can definitely   efficient however really minor issues","dateFull":"2017-02-05"},{"title":"Excellent Atmosphere","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Great working team and culture","cons":"not much to say  young employees but adding age and experience","date":" 30 Jan 2017","company":"Vidyard","prosClean":"great working team  culture","consClean":" much  say  young employees  adding age  experience","dateFull":"2017-01-30"},{"title":"Great place to start and prove yourself","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Great office and work environmentYou can get behind the product","cons":"Work/life balance  tough to actually balance it","date":" 14 Jan 2017","company":"Vidyard","prosClean":"great office  work environmentyou can get behind  product","consClean":"worklife balance  tough  actually balance ","dateFull":"2017-01-14"},{"title":"Awesome Interview Process & Company!","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"The people, perks, constant and exciting technological change. Everything about this company is fun, and the new office is a great environment.","cons":"A lot of information to take in at first when training. But the managers and colleagues  even those not on the same team  make it a lot easier.","date":" 4 Sep 2016","company":"Vidyard","prosClean":"the people perks constant  exciting technological change everything   company  fun   new office   great environment","consClean":"a lot  information  take   first  training but  managers  colleagues  even      team  make   lot easier","dateFull":"2016-09-04"},{"title":"Fantastic Company to work for","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"The culture at Vidyard is second to none. Everyone is there to work hard, but the vibe is light and everyone is having fun at the same time.","cons":"No cons to speak of. Great place to work, great office, great management.","date":" 27 Jul 2016","company":"Vidyard","prosClean":"the culture  vidyard  second  none everyone    work hard   vibe  light  everyone   fun    time","consClean":"no cons  speak  great place  work great office great management","dateFull":"2016-07-27"},{"title":"Great","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Vidyard is an excellent place to work. The work is great, the people are great, the perks are great!","cons":"There really are no cons to working at Vidyard.","date":" 5 May 2016","company":"Vidyard","prosClean":"vidyard   excellent place  work the work  great  people  great  perks  great","consClean":"there really   cons  working  vidyard","dateFull":"2016-05-05"},{"title":"Great place to start your career in sales","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Great training, growth, support, mentorship","cons":"Parking in downtown kitchener is pricy","date":" 6 Apr 2016","company":"Vidyard","prosClean":"great training growth support mentorship","consClean":"parking  downtown kitchener  pricy","dateFull":"2016-04-06"},{"title":"Great place to work","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Free lunches, great sprit around the office and very social, unlimited holiday  noone wants to abuse it","cons":"the parking costs in DTK can be costly if communting (150 ish p month)","date":" 17 Mar 2016","company":"Vidyard","prosClean":"free lunches great sprit around  office   social unlimited holiday  noone wants  abuse ","consClean":" parking costs  dtk can  costly  communting  ish p month","dateFull":"2016-03-17"},{"title":"Good way to start a sales career","rating":"4.0","recomends":"Recommends","outlook":"Neutral Outlook","pros":"easy going team, fun to work with, food and beverages provided","cons":"salary isn't on par for other similar companies in the area.","date":" 20 Jan 2016","company":"Vidyard","prosClean":"easy going team fun  work  food  beverages provided","consClean":"salary   par   similar companies   area","dateFull":"2016-01-20"},{"title":"Awesome Place to Work!","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":" Part of an organization that is focused on working hard while having fun Empowered to help make business decisions on the go Being part of a a growing industry with many diverse challenges and opportunities","cons":" None to think of, other than getting the occasional NERF dart fired at your desk","date":" 4 May 2015","company":"Vidyard","prosClean":" part   organization   focused  working hard   fun empowered  help make business decisions   go being part    growing industry  many diverse challenges  opportunities","consClean":" none  think    getting  occasional nerf dart fired   desk","dateFull":"2015-05-04"},{"title":"Engineer","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Without question the best place to work in KW. Amazing people to work with, great benefits and compensation, lots of extracurricular activities going on, and very easy to maintain worklife balance. Hard working, but flexible would describe the atmosphere at Vidyard.","cons":"Definitely need to be in charge of your own job. Nobody will tell you what to do or micromanage you. You'll need to own your own projects and be the boss of your own little slice!","date":" 15 Mar 2015","company":"Vidyard","prosClean":"without question  best place  work  kw amazing people  work  great benefits  compensation lots  extracurricular activities going    easy  maintain worklife balance hard working  flexible  describe  atmosphere  vidyard","consClean":"definitely need    charge    job nobody will tell      micromanage  youll need     projects    boss    little slice","dateFull":"2015-03-15"},{"title":"The Vidyard team is incredibly welcoming. Everyone is hardworking and gets behind the goals set for the company.","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Great people, unlimited vacation, catered lunches, high growth","cons":"Still missing concrete training programs for junior sales staff","date":" 11 Mar 2015","company":"Vidyard","prosClean":"great people unlimited vacation catered lunches high growth","consClean":"still missing concrete training programs  junior sales staff","dateFull":"2015-03-11"},{"title":"Life as a Vidyardian","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Fun and transparent culture, high energy environment, nothing but toptalent employees! Truly a great environment to create, learn and build a career.","cons":"Can't call out any major negatives to life at Vidyard, but it's a fast paced environment where everyone has individual accountability so it's not the place for you if you're looking for somewhere to sit back and wait to be told what to do.","date":" 3 Mar 2015","company":"Vidyard","prosClean":"fun  transparent culture high energy environment nothing  toptalent employees truly  great environment  create learn  build  career","consClean":"cant call   major negatives  life  vidyard    fast paced environment  everyone  individual accountability     place     looking  somewhere  sit back  wait   told   ","dateFull":"2015-03-03"},{"title":"It's like Bill Murray's perfect 24 hours in Groundhog Day","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Good pay, autonomy, freedom, plenty of challenges, and the opportunity to work creatively with other deep thinkers. Catered lunch everyday is delicious and extending my lifespan (at least most days)","cons":"If you need a structured environment, then this isn't the place for you. Parking isn't free, which could be an issue if you need to commute. Sometimes you need to put in a little extra time, but that's true of most places worth working at.","date":" 2 Mar 2015","company":"Vidyard","prosClean":"good pay autonomy freedom plenty  challenges   opportunity  work creatively   deep thinkers catered lunch everyday  delicious  extending  lifespan  least  days","consClean":"if  need  structured environment     place   parking  free     issue   need  commute sometimes  need  put   little extra time   true   places worth working ","dateFull":"2015-03-02"},{"title":"Young company growing quickly in an exciting market with a great group of coworkers.","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Coming from a larger company Vidyard has been refreshing. The company is made up of a great group of people that are all highly effective at their jobs.The engineering group works hard to minimize meetings and process overhead. It's a great place to work for someone who is selfdirected and doesn't require a lot of hand holding.Perks like the catered lunch help to ensure everyone knows who they're working with and maintain company culture.","cons":"It's a startup so sometimes things are chaotic and some may find the lack of processes scary.","date":" 2 Mar 2015","company":"Vidyard","prosClean":"coming   larger company vidyard   refreshing the company  made    great group  people    highly effective   jobsthe engineering group works hard  minimize meetings  process overhead its  great place  work  someone   selfdirected   require  lot  hand holdingperks like  catered lunch help  ensure everyone knows   working   maintain company culture","consClean":"its  startup  sometimes things  chaotic   may find  lack  processes scary","dateFull":"2015-03-02"},{"title":"Video Marketing Specialist (Account Executive)","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Awesome to see the company grow and be a part of the amazing culture! Everyday you can see the direct impact you have on the business.Also the benefits are better than I had at big corporations!","cons":"Definitely challenging compared to being a small role at a large corporation. Every day you have to step it up and help grow the business.","date":" 2 Mar 2015","company":"Vidyard","prosClean":"awesome  see  company grow    part   amazing culture everyday  can see  direct impact     businessalso  benefits  better  i   big corporations","consClean":"definitely challenging compared    small role   large corporation every day    step    help grow  business","dateFull":"2015-03-02"},{"title":"Sales & Marketing Area","rating":"2.0","recomends":"Doesn't Recommend","outlook":"Negative Outlook","pros":"There are many smart, hardworking, helpful people in the Cambridge office.Good tools (laptop, CRM, phone, etc.)Free snacks and drinks.","cons":"Disrespectful, bullying behaviour goes uncorrected.Lack of diversity in management in most departments.Senior Management Team keeps its distance from the majority of the employees.Too much turnover for a growing firm in a hot sector.Too many executives leaving or dismissed in past year.","date":" 6 Dec 2017","company":"eSentire","prosClean":"there  many smart hardworking helpful people   cambridge officegood tools laptop crm phone etcfree snacks  drinks","consClean":"disrespectful bullying behaviour goes uncorrectedlack  diversity  management   departmentssenior management team keeps  distance   majority   employeestoo much turnover   growing firm   hot sectortoo many executives leaving  dismissed  past year","dateFull":"2017-12-06"},{"title":"Best place i have ever worked.","rating":"4.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"The company has a great culture that supports it's employees professionally and personally. There are countless opportunity for growth within the company and the management is constantly looking for ways to better the life of employees and make their work more efficient.","cons":"You might have to work some odd hours because it is 24/7 security operations company","date":" 21 Sep 2017","company":"eSentire","prosClean":"the company   great culture  supports  employees professionally  personally there  countless opportunity  growth within  company   management  constantly looking  ways  better  life  employees  make  work  efficient","consClean":"you might   work  odd hours     security operations company","dateFull":"2017-09-21"},{"title":"A great place to work and grow","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Interesting field, no shortage of opportunities to learn, good managers of most departments.","cons":"None  really just filling 5 words here.","date":" 13 Sep 2017","company":"eSentire","prosClean":"interesting field  shortage  opportunities  learn good managers   departments","consClean":"none  really just filling  words ","dateFull":"2017-09-13"},{"title":"Great people; challenging workplace; bright future","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Simply the best people I've ever worked with. No lack of technical projects to be done. Great benefits package. Concierge service is terrific.","cons":"Sometimes focus can be difficult as priorities get overruled by firefighting. Cambridge is not a particularly hip locale for techies.","date":" 3 Sep 2017","company":"eSentire","prosClean":"simply  best people ive ever worked  no lack  technical projects   done great benefits package concierge service  terrific","consClean":"sometimes focus can  difficult  priorities get overruled  firefighting cambridge    particularly hip locale  techies","dateFull":"2017-09-03"},{"title":"Cybersecurity is a great space  eSentire has some good things","rating":"3.0","recomends":"Recommends","outlook":"Neutral Outlook","pros":"The space they are in is a space where technology rules. Trying to build an inclusive culture. OK workspaces","cons":"Leadership is a bit scattered.","date":" 6 Sep 2017","company":"eSentire","prosClean":"the space      space  technology rules trying  build  inclusive culture ok workspaces","consClean":"leadership   bit scattered","dateFull":"2017-09-06"},{"title":"Fantastic people  ready to transition away from being a small company.","rating":"4.0","recomends":"Recommends","outlook":"Positive Outlook","pros":" seasoned leaders: pragmatic, get along well with each other small size means a familylike atmosphere: good exposure to different parts of the org good health benefits package concierge service is a fantastic perk altruistic in knowing you are keeping the world safe from hackers Keeping Clients Protected is a strong value that is upheld","cons":" shifting culture as we get bigger: leadership needs to acknowledge it now takes more effort to communicate with employees lack of annual bonus, stock program, annual raises location: Cambridge sucks; forget hip coffee shops and cool restaurants to hang out at; very little opportunity to socialize with peers in the hitech industry, as they are all in K/W","date":" 18 Jul 2017","company":"eSentire","prosClean":" seasoned leaders pragmatic get along well    small size means  familylike atmosphere good exposure  different parts   org good health benefits package concierge service   fantastic perk altruistic  knowing   keeping  world safe  hackers keeping clients protected   strong value   upheld","consClean":" shifting culture   get bigger leadership needs  acknowledge  now takes  effort  communicate  employees lack  annual bonus stock program annual raises location cambridge sucks forget hip coffee shops  cool restaurants  hang    little opportunity  socialize  peers   hitech industry      kw","dateFull":"2017-07-18"},{"title":"Joke of a place","rating":"1.0","recomends":"Doesn't Recommend","outlook":"Negative Outlook","pros":"Nothing, just trying to get to the 20 word max word count! Money was average but you get zero experience and are surrounded by idiot management","cons":"Literally an office full of glorified secretaries who are titled 'security analysts' who have no security experience, led by management judging their performance who have never worked in security before working here! (you can verify this by looking them up on LinkedIn! )","date":" 15 Aug 2017","company":"eSentire","prosClean":"nothing just trying  get    word max word count money  average   get zero experience   surrounded  idiot management","consClean":"literally  office full  glorified secretaries   titled security analysts    security experience led  management judging  performance   never worked  security  working   can verify   looking    linkedin ","dateFull":"2017-08-15"},{"title":"Great place to work.","rating":"4.0","recomends":"Recommends","outlook":"Positive Outlook","pros":" Tremendous customer satisfaction Great people  have a blast working there Incredible growth opportunity Ability to progress in career","cons":" More focus on innovation is necessary Leadership with stronger security backgrounds Improved vision for future Not much else","date":" 20 Jun 2017","company":"eSentire","prosClean":" tremendous customer satisfaction great people    blast working  incredible growth opportunity ability  progress  career","consClean":" more focus  innovation  necessary leadership  stronger security backgrounds improved vision  future not much else","dateFull":"2017-06-20"},{"title":"HIgh growth with accountability","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"effort to balance a committed career with life style","cons":"getting participation generally from work groups and colleagues to effect positive change","date":" 22 Jun 2017","company":"eSentire","prosClean":"effort  balance  committed career  life style","consClean":"getting participation generally  work groups  colleagues  effect positive change","dateFull":"2017-06-22"},{"title":"Great for starting a career","rating":"3.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"ESentire has no problem hiring people directly out of school, which is great. So many other companies want people with x years of experience, so it's great that eSentire gives people that option.A really great place to get a wide variety of industry knowledge and experience.Great benefits and a solid RRSP program.Generally supportive management.One of the best founders around. Eldon is actively involved in the company and the industry. He's also a first class guy with a great personality.","cons":"Low starting wage in comparison to other companies. To be fair, eSentire is located in Cambridge, which doesn't really have the bustling competition of Toronto, so take that how you will.You don't really get yearly bonuses or raises. I've known people who've been there for multiple years without a single raise or bonus.Great place to start a career, but not to necessarily develop it. There's very little room for upward mobility from within the SOC. You can become a senior SOC analyst, which does bump you up into another salary range, but there really isn't anywhere to go from there. Professional Services requires a skillset that isn't overly obtainable as a SOC analyst  they generally hire externally.A lot of lateral movements and very few promotions, so more responsibility for the same pay.","date":" 24 Jun 2017","company":"eSentire","prosClean":"esentire   problem hiring people directly   school   great so many  companies want people  x years  experience   great  esentire gives people  optiona really great place  get  wide variety  industry knowledge  experiencegreat benefits   solid rrsp programgenerally supportive managementone   best founders around eldon  actively involved   company   industry hes also  first class guy   great personality","consClean":"low starting wage  comparison   companies to  fair esentire  located  cambridge   really   bustling competition  toronto  take    willyou  really get yearly bonuses  raises ive known people ve    multiple years without  single raise  bonusgreat place  start  career    necessarily develop  theres  little room  upward mobility  within  soc you can become  senior soc analyst   bump    another salary range   really  anywhere  go   professional services requires  skillset   overly obtainable   soc analyst   generally hire externallya lot  lateral movements    promotions   responsibility    pay","dateFull":"2017-06-24"},{"title":"Great potential  scarily toxic environment","rating":"1.0","recomends":"Doesn't Recommend","outlook":"Negative Outlook","pros":"Doing innovative, important work with some really smart people. Trying to have perks to make up for location and some of the issues listed below.","cons":"The office is in the middle of nowhere.Salary is weak, benefits are weaker.Worst part is the toxic environment of complete and total distrust, stemming from a few vicious, political leaders that run specific departments. Such potential squandered by such horrible people.","date":" 19 Jun 2017","company":"eSentire","prosClean":"doing innovative important work   really smart people trying   perks  make   location     issues listed ","consClean":"the office    middle  nowheresalary  weak benefits  weakerworst part   toxic environment  complete  total distrust stemming    vicious political leaders  run specific departments such potential squandered   horrible people","dateFull":"2017-06-19"},{"title":"BDR Review","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Great Benefits, Company Culture, Fair Pay, Free Lunches etc  New age tech environment","cons":"Inconsistent relationship between BDR and Field Sales  Constant Conflict in some areas  Marketing and Sales should merge into one office  more communication between the two areas would foster more revenue","date":" 20 Dec 2016","company":"eSentire","prosClean":"great benefits company culture fair pay free lunches etc  new age tech environment","consClean":"inconsistent relationship  bdr  field sales  constant conflict   areas  marketing  sales  merge  one office   communication   two areas  foster  revenue","dateFull":"2016-12-20"},{"title":"Good place but needs to get with the times","rating":"4.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"+Great culture+Good management+Free pop and weekly lunch+Ability to move within the company","cons":"low salary for security rolesstrenuous sick time policyturnover due to salary issues","date":" 28 Nov 2016","company":"eSentire","prosClean":"great culturegood managementfree pop  weekly lunchability  move within  company","consClean":"low salary  security rolesstrenuous sick time policyturnover due  salary issues","dateFull":"2016-11-28"},{"title":"Customer Care SOC Analyst (COOP)","rating":"5.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"eSentire is honestly an amazing place to work. Everybody is friendly, and right off the bat you get welcomed to the company, and you begin your training. Training is indepth, and you must pass a final exam, but it is very rewarding, and there is a lot to learn that I will take with me throughout my career.The Customer Care Role deals with clientfacing issues, and you are able to quickly feel like you are a part of the team, not just a coop student. You gain access to more information than if you were in other departments, and it helps with learning what needs to be improved, and you are also able to be a part of that improvement.The mindset is very easy going, as long as you are a keen individual and seek to constantly learn more. All one needs to do is ask how to do something, or for an extra responsibility, and the team happily provides. Did I also mention the team is awesome?","cons":"In the client facing role, you deal with clientrequests, which are not always easy, and you need to be comfortable with not always knowing the answer. Some may view a final exam for training to be a con as well.If there is anything that I can see as a con, it is that the company is still growing, and has so called 'growing pains', like any company would. They are being fixed, but it is an issue that exists.","date":" 19 Sep 2016","company":"eSentire","prosClean":"esentire  honestly  amazing place  work everybody  friendly  right   bat  get welcomed   company   begin  training training  indepth   must pass  final exam     rewarding     lot  learn  i will take   throughout  careerthe customer care role deals  clientfacing issues    able  quickly feel like    part   team  just  coop student you gain access   information       departments   helps  learning  needs   improved    also able    part   improvementthe mindset   easy going  long     keen individual  seek  constantly learn  all one needs    ask    something    extra responsibility   team happily provides did i also mention  team  awesome","consClean":"in  client facing role  deal  clientrequests    always easy   need   comfortable   always knowing  answer some may view  final exam  training    con  wellif   anything  i can see   con     company  still growing    called growing pains like  company  they   fixed     issue  exists","dateFull":"2016-09-19"},{"title":"Depends which department.","rating":"3.0","recomends":"Doesn't Recommend","outlook":"Negative Outlook","pros":"Mostly very nice people. Free Lunch once a week. management does a good job with trying to treat staff well. Very good benefits. Growing company that provides a solid product.","cons":"High turnover is some departments. They have posted 3 times for the same position in less than 1 year. Not overly accessible by transit. Not very close to lunch options.","date":" 25 Feb 2016","company":"eSentire","prosClean":"mostly  nice people free lunch   week management   good job  trying  treat staff well very good benefits growing company  provides  solid product","consClean":"high turnover   departments they  posted  times    position  less   year not overly accessible  transit not  close  lunch options","dateFull":"2016-02-25"},{"title":"Great place","rating":"4.0","recomends":"Doesn't Recommend","outlook":"Positive Outlook","pros":"Free catered food once a weekFriendly Environment","cons":"In an industrial area, sucks if you don't have a car","date":" 14 Dec 2015","company":"eSentire","prosClean":"free catered food   weekfriendly environment","consClean":"in  industrial area sucks      car","dateFull":"2015-12-14"},{"title":"Developer Intern","rating":"4.0","recomends":"Recommends","outlook":"Positive Outlook","pros":"Care about youDecent perks (weekly catered lunch, free drinks)Good team","cons":"Location is not the bestRapidly growing so can be disorganized","date":" 13 Oct 2015","company":"eSentire","prosClean":"care  youdecent perks weekly catered lunch free drinksgood team","consClean":"location    bestrapidly growing  can  disorganized","dateFull":"2015-10-13"}]
